WSDL/Producao/PPonteNovaMG-Memory.wsdl

<?xml version="1.0" encoding="ISO-8859-1"?>
<definitions xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="urn:loterpswsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="urn:loterpswsdl">
<types><xsd:schema targetNamespace="urn:loterpswsdl"
>
 <xsd:import namespace="http://schemas.xmlsoap.org/soap/encoding/" />
 <xsd:import namespace="http://schemas.xmlsoap.org/wsdl/" />
</xsd:schema>
</types>
<message name="tm_lote_rps_service.testarLoteRPSRequest"><part name="xml" type="xsd:string" /><part name="codMunicipio" type="xsd:string" /><part name="cnpjPrestador" type="xsd:string" /><part name="hashValidador" type="xsd:string" /></message>
<message name="tm_lote_rps_service.testarLoteRPSResponse"><part name="return" type="xsd:string" /></message>
<message name="tm_lote_rps_service.importarLoteRPSRequest"><part name="xml" type="xsd:string" /><part name="codMunicipio" type="xsd:string" /><part name="cnpjPrestador" type="xsd:string" /><part name="hashValidador" type="xsd:string" /></message>
<message name="tm_lote_rps_service.importarLoteRPSResponse"><part name="return" type="xsd:string" /></message>
<message name="tm_lote_rps_service.consultarLoteRPSRequest"><part name="protocolo" type="xsd:string" /><part name="codMunicipio" type="xsd:string" /><part name="cnpjPrestador" type="xsd:string" /><part name="hashValidador" type="xsd:string" /></message>
<message name="tm_lote_rps_service.consultarLoteRPSResponse"><part name="return" type="xsd:string" /></message>
<message name="tm_lote_rps_service.consultarRPSRequest"><part name="numeroRPS" type="xsd:string" /><part name="codMunicipio" type="xsd:string" /><part name="cnpjPrestador" type="xsd:string" /><part name="hashValidador" type="xsd:string" /></message>
<message name="tm_lote_rps_service.consultarRPSResponse"><part name="return" type="xsd:string" /></message>
<message name="tm_lote_rps_service.cancelarNFSERequest"><part name="numeroNFSE" type="xsd:string" /><part name="codMunicipio" type="xsd:string" /><part name="cnpjPrestador" type="xsd:string" /><part name="hashValidador" type="xsd:string" /></message>
<message name="tm_lote_rps_service.cancelarNFSEResponse"><part name="return" type="xsd:string" /></message>
<message name="tm_lote_rps_service.consultarNFSERequest"><part name="numeroNFSE" type="xsd:string" /><part name="codMunicipio" type="xsd:string" /><part name="cnpjPrestador" type="xsd:string" /><part name="hashValidador" type="xsd:string" /></message>
<message name="tm_lote_rps_service.consultarNFSEResponse"><part name="return" type="xsd:string" /></message>
<message name="tm_lote_rps_service.servicoRPSRequest"><part name="nomeServico" type="xsd:string" /><part name="parametros" type="xsd:string" /><part name="codMunicipio" type="xsd:string" /><part name="cnpjPrestador" type="xsd:string" /><part name="hashValidador" type="xsd:string" /></message>
<message name="tm_lote_rps_service.servicoRPSResponse"><part name="return" type="xsd:string" /></message>
<portType name="loterpswsdlPortType"><operation name="tm_lote_rps_service.testarLoteRPS"><documentation>Efetua um teste na importação do lote RPS e retorna um xml com avisos, erros e confirmações emitidas pelo sistema, além de um boleando (&quot;Status&quot;) informando a situação do teste, ou seja, TRUE para sucesso e FALSE para falha.</documentation><input message="tns:tm_lote_rps_service.testarLoteRPSRequest"/><output message="tns:tm_lote_rps_service.testarLoteRPSResponse"/></operation><operation name="tm_lote_rps_service.importarLoteRPS"><documentation>Efetua a importação do lote RPS e retorna um xml com avisos, erros e confirmações emitidas pelo sistema, além de um boleando (&quot;Status&quot;) informando a situação do teste, ou seja, TRUE para sucesso e FALSE para falha. Este método executará o teste de validade do lote antes de efetuar a importação. Em caso de sucesso, será retornado também o protocolo gerado para o lote, que poderá ser utilizado para consulta mais tarde. </documentation><input message="tns:tm_lote_rps_service.importarLoteRPSRequest"/><output message="tns:tm_lote_rps_service.importarLoteRPSResponse"/></operation><operation name="tm_lote_rps_service.consultarLoteRPS"><documentation>Efetua uma consulta no estado do lote de RPS's através do protocolo de importação, gerado apenas em caso de sucesso.</documentation><input message="tns:tm_lote_rps_service.consultarLoteRPSRequest"/><output message="tns:tm_lote_rps_service.consultarLoteRPSResponse"/></operation><operation name="tm_lote_rps_service.consultarRPS"><documentation>Efetua uma consulta no estado do RPS's através do protocolo de importação, gerado apenas em caso de sucesso.</documentation><input message="tns:tm_lote_rps_service.consultarRPSRequest"/><output message="tns:tm_lote_rps_service.consultarRPSResponse"/></operation><operation name="tm_lote_rps_service.cancelarNFSE"><documentation>Efetua o cancelamento de uma nota fiscal.</documentation><input message="tns:tm_lote_rps_service.cancelarNFSERequest"/><output message="tns:tm_lote_rps_service.cancelarNFSEResponse"/></operation><operation name="tm_lote_rps_service.consultarNFSE"><documentation>Efetua uma consulta a uma nota fiscal.</documentation><input message="tns:tm_lote_rps_service.consultarNFSERequest"/><output message="tns:tm_lote_rps_service.consultarNFSEResponse"/></operation><operation name="tm_lote_rps_service.servicoRPS"><documentation>Envoca um serviço relacionados a RPS's.</documentation><input message="tns:tm_lote_rps_service.servicoRPSRequest"/><output message="tns:tm_lote_rps_service.servicoRPSResponse"/></operation></portType>
<binding name="loterpswsdlBinding" type="tns:loterpswsdlPortType"><soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/><operation name="tm_lote_rps_service.testarLoteRPS"><soap:operation soapAction="urn:loterpswsdl#tm_lote_rps_service.testarLoteRPS" style="rpc"/><input><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="tm_lote_rps_service.importarLoteRPS"><soap:operation soapAction="urn:loterpswsdl#tm_lote_rps_service.importarLoteRPS" style="rpc"/><input><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="tm_lote_rps_service.consultarLoteRPS"><soap:operation soapAction="urn:loterpswsdl#tm_lote_rps_service.consultarLoteRPS" style="rpc"/><input><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="tm_lote_rps_service.consultarRPS"><soap:operation soapAction="urn:loterpswsdl#tm_lote_rps_service.consultarRPS" style="rpc"/><input><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="tm_lote_rps_service.cancelarNFSE"><soap:operation soapAction="urn:loterpswsdl#tm_lote_rps_service.cancelarNFSE" style="rpc"/><input><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="tm_lote_rps_service.consultarNFSE"><soap:operation soapAction="urn:loterpswsdl#tm_lote_rps_service.consultarNFSE" style="rpc"/><input><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation><operation name="tm_lote_rps_service.servicoRPS"><soap:operation soapAction="urn:loterpswsdl#tm_lote_rps_service.servicoRPS" style="rpc"/><input><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></input><output><soap:body use="encoded" namespace="urn:loterpswsdl" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/></output></operation></binding>
<service name="loterpswsdl"><port name="loterpswsdlPort" binding="tns:loterpswsdlBinding"><soap:address location="http://nfsebrasil.net.br/nfse/ws/lote_rps_service.php"/></port></service>
</definitions>